adding readme of project
